# Ввести з клавіатури ціле додатне число n.
# Отримати суму кубів всіх натуральних чисел від 1 до n(включаючи n).
# Винятки становлять усі числа кратні числу 3.
# Реалізувати у 2-х варіантах: використовуючи цикл while та цикл for


user_number = int(input("Enter the value: "))

result_1 = 0
for index in range(1, user_number + 1):
    if not index % 3 == 0:
        index **= 3
        result_1 += index
print(f"Total sum: {result_1} ")

counter = 0
index = 1
result_2 = 0
while counter < user_number:
    counter += 1
    if counter % 3 == 0:
        continue
    index = counter ** 3
    result_2 += index
print(f"Total sum: {result_2} ")

# ----------------------------------------------------------------

# Даний словник, створити новий словник, змінивши місцями ключ та значення.
# У новий словник вставляти лише ті пари ключ-значення, які мають значення
# у початковому словнику понад 2000
# chess_players = {
#   "Carlsen, Magnus": 1865,
#   "Firouzja, Alireza": 2804,
#   "Ding, Liren": 2799,
#   "Caruana, Fabiano": 1792,
#   "Nepomniachtchi, Ian": 2773
# }
#
# *Додаткове не обов'язкове завдання:
# значення нового словника повинні складатися не з прізвища та імені розділених
# комою, а з прізвища, тільки першої літери імені та точки.
# Результат має бути наступним:
# new_chess_players = {
# 2804: 'Firouzja A.',
# 2799: 'Ding L.',
# 2773: 'Nepomniachtchi I.'
# }


chess_players = {
  "Carlsen, Magnus": 2865,
  "Firouzja, Alireza": 1804,
  "Ding, Liren": 2799,
  "Caruana, Fabiano": 2792,
  "Nepomniachtchi, Ian": 1773
}

new_chess_players = {value: key for key, value in chess_players.items()}

best_players = {value: f"{key.split()[0].strip(',')} {key.split()[1][0]}."
                for key, value in chess_players.items() if value > 2000}

print(chess_players)
print(best_players)

# ----------------------------------------------------------------

# Запитати у користувача вік.
# Якщо вік менше 0 або введено не число – вивести Wrong input
# Якщо вік менше або дорівнює 12 - вивести Orange
# Якщо вік більше 12 і менше 18 - вивести CocaCola
# Інакше - вивести Beer

age = input()

if not age.isdigit() or int(age) <= 0:
    print('Wrong input')
elif int(age) <= 12:
    print('Orange')
# elif int(age) > 12 and int(age) < 18:
# elif 12 < int(age) < 18:
elif int(age) < 18:
    print('Orange')
else:
    print('Beer')

# ----------------------------------------------------------------

# Ввести речення.
# Якщо у реченні є слово code - вивести на екран Yes, 1
# Якщо у реченні є слово codec - вивести на екран Yes, 2
# Інакше вивести на екран No

input_str = input()
if 'codec' in input_str:
    print('Yes, 2')
elif 'code' in input_str:
    print('Yes, 1')
else:
    print('No')

# ----------------------------------------------------------------

# Запросити у користувача число. Якщо введено не ціле число, видати на екран
# повідомлення: "не вірне введення"
# Якщо введено число, то за допомогою тернарного виразу обчислити яке число
# введено – парне чи непарне. (Умова перевірки на парність: х % 2)
# Після цього вивести на екран: "Ви ввели парне число" або "Ви ввели непарне
# число". При цьому вивід необхідно організувати у вигляді шаблону, у який
# залежно від введення підставляється слово "парне" або "непарне".
#
# *Додаткове необов'язкове завдання: тернарний вираз вміє крім визначення
# парне/непарне так само визначати нуль.


digit_user = input("Введить ціле число: ")
if digit_user and (digit_user.isdigit() or (digit_user[0] == '-' and digit_user[1:].isdigit())):
    digit_user = int(digit_user)
    result = "0" if digit_user == 0 else "even" if digit_user % 2 == 0 else "odd"
    print(f'digit_user is {result}')
else:
    print("не вірне введення")

# ----------------------------------------------------------------

# Використовуючи input() ввести речення, що складається з двох слів.
# Створити 2 змінні та в кожну записати по 1 введеному слову, використовуючи
# методи строк. Створити нову змінну трьома різними способами форматування
# (фактично 3 змінні), які складаються з введених слів у зворотному порядку,
# перше слово має складатися лише з великих літер, а друге з першої великої
# літери та інших дрібних. На початку речення повинен бути знак оклику, а в
# кінці запитальний.
# Використовуючи лише атрибути функції print(), вивести початковий рядок і
# отримані різними способами форматування через роздільник "<<<>>>".
#
# *Додаткове не обов'язкове завдання: вивід зробити у файл.
#
# Приклад виконання програми:
# введене речення: "кішка охайна"
# значення першої змінної: "кішка"
# значення другої змінної: "охайна"
# нова змінна: "!ОХАЙНА Кішка?"
# Цю змінну треба створити 3-ма різними способами форматування строк
# (%-форматування, метод .format та f-string). Буде 3 нові змінні з
# однаковими значеннями.
# Вивод функції print() повинен бути наступним:
# кішка охайна<<<>>>!ОХАЙНА Кішка?<<<>>>!ОХАЙНА Кішка?<<<>>>!ОХАЙНА Кішка?


text = input("Введіть речення із двох слів: ")
splitted_text = text.split()
first_word = splitted_text[0].title()
second_word = splitted_text[1].upper()
reverse_text_1 = f"!{second_word} {first_word}?"
reverse_text_2 = "!%s %s?" % (second_word, first_word)
reverse_text_3 = "!{1} {0}?".format(first_word, second_word)
new_file = open("splitted_file.txt", "w")
print(text, reverse_text_1, reverse_text_2, reverse_text_3, sep="<<<>>>", file=new_file)
new_file.close()

# ----------------------------------------------------------------

# Написати програму яка отримає ім'я та вік користувача, перевіряє вік та
# видає вітальне повідомлення залежно від віку:
# - нуль чи не число: “Помилка, повторіть введення”;
# - більше нуля до 10 не включаючи: “Привіт, шкет «Ім'я»”;
# - від 10 до 18 включаючи: "Як справи, «Ім'я»?"
# - більше 18 і менше 100: "Що бажаєте «Ім'я»?
# - інакше: "«Ім'я», ви брешете - у наш час стільки не живуть..."
#
# *Додаткове не обов'язкове завдання:
# Програму необхідно загорнути у вічний цикл.
# Після чергового відпрацювання коду запитувати у користувача "Бажаєте вийти? (Т/Y)".
# Якщо відповідь буде буква "Т" або буква "Y" у будь-якому регістрі, то зробити
# вихід із вічного циклу. В іншому випадку продовжити виконання програми знову.


while True:

    name = input("Введіть ваше ім'я: ").title()
    age = input("Введіть ваш вік: ")

    if age.isalpha() or int(age) == 0 or not name.isalpha():
        print("Помилка, повторіть введення", sep="\n")
        continue
    elif int(age) < 10:
        print(f"Привіт, шкет {name}")
    elif int(age) <= 18:
        print(f"Як справи, {name}?")
    elif int(age) < 100:
        print(f"Що бажаєте {name}?")
    else:
        print(f"{name}, ви брешете - у наш час стільки не живуть...")

    answer = input("Бажаєте вийти? (Д/Y)").lower()
    if answer in ("y", "д"):
        break

    # --------------------------------



